In [2]:
import pandas as pd
import numpy as np

In [4]:
s =pd.Series([1,2,3,4,5,6,7,8,9,10,45.5]) #Creating Series using pandas

In [5]:
s

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0
10    45.5
dtype: float64

In [11]:
d = pd.date_range('20210301',periods=10)
d

DatetimeIndex(['2021-03-01', '2021-03-02', '2021-03-03', '2021-03-04',
               '2021-03-05', '2021-03-06', '2021-03-07', '2021-03-08',
               '2021-03-09', '2021-03-10'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df1 = pd.DataFrame(np.random.randn(10,4),index = d ,columns = ['A','B','C','D']) #Creating a Data Frame

In [13]:
df1    #created by passing numpy array

                   A         B         C         D
2021-03-01 -0.593139 -0.048465  0.694860  0.507509
2021-03-02  1.174754  0.690178 -0.258073  0.090160
2021-03-03  0.093430  1.357518  0.098377  0.220102
2021-03-04 -1.627848 -0.733497  0.986889 -0.717067
2021-03-05 -0.303315 -0.036739  1.255154 -0.250272
2021-03-06 -0.373427 -1.794087 -1.012884 -1.705452
2021-03-07  0.419680  1.977034  0.226841  0.156831
2021-03-08 -0.160447 -0.495699 -1.336895 -0.230509
2021-03-09 -0.261749 -0.767675 -0.805742  1.127479
2021-03-10 -0.396007  0.847941  0.306677 -0.373018

In [22]:
df1 = pd .DataFrame({'A':[1,2,3,4],                  #Creating A A Data Frame by passing a dictionary of objects 
                   'B':pd.Timestamp(20210302),
                   'C':pd.Series(1,index= list(range(4)),dtype= 'float32'), 
                   'D':np.array([5]*4,dtype= 'int32'),
                   'E':pd.Categorical(['true','False','true','False']),
                   'F':'JOHNMARY'})

In [23]:
df1

   A                             B    C  D      E         F
0  1 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
1  2 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY
2  3 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
3  4 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY

In [24]:
df1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [26]:
df.head(2)   #Show the first two rows

   A                             B    C  D      E         F
0  1 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
1  2 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY

In [27]:
df.tail(2) #Show the last two rows hahah

   A                             B    C  D      E         F
2  3 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
3  4 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY

In [28]:
df.index     #Show index

Int64Index([0, 1, 2, 3], dtype='int64')

In [29]:
df.columns      #Show columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [31]:
#Creating a numpy Array
df.to_numpy()

array([[1, Timestamp('1970-01-01 00:00:00.020210302'), 1.0, 5, 'true',
        'JOHNMARY'],
       [2, Timestamp('1970-01-01 00:00:00.020210302'), 1.0, 5, 'False',
        'JOHNMARY'],
       [3, Timestamp('1970-01-01 00:00:00.020210302'), 1.0, 5, 'true',
        'JOHNMARY'],
       [4, Timestamp('1970-01-01 00:00:00.020210302'), 1.0, 5, 'False',
        'JOHNMARY']], dtype=object)

In [33]:
df.describe()

              A    C    D
count  4.000000  4.0  4.0
mean   2.500000  1.0  5.0
std    1.290994  0.0  0.0
min    1.000000  1.0  5.0
25%    1.750000  1.0  5.0
50%    2.500000  1.0  5.0
75%    3.250000  1.0  5.0
max    4.000000  1.0  5.0

In [34]:
df.sort_index (axis=1,ascending= False )   #Sorting by Index

          F      E  D    C                             B  A
0  JOHNMARY   true  5  1.0 1970-01-01 00:00:00.020210302  1
1  JOHNMARY  False  5  1.0 1970-01-01 00:00:00.020210302  2
2  JOHNMARY   true  5  1.0 1970-01-01 00:00:00.020210302  3
3  JOHNMARY  False  5  1.0 1970-01-01 00:00:00.020210302  4

In [36]:
df.sort_values (by = 'C')  Sorting by Values

   A                             B    C  D      E         F
0  1 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
1  2 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY
2  3 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
3  4 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY

In [45]:
df['B']   #Getting Single value from data frame

0   1970-01-01 00:00:00.020210302
1   1970-01-01 00:00:00.020210302
2   1970-01-01 00:00:00.020210302
3   1970-01-01 00:00:00.020210302
Name: B, dtype: datetime64[ns]

In [46]:
df[0:3]   #Using Slicing

   A                             B    C  D      E         F
0  1 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
1  2 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY
2  3 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY

In [47]:
df1[df['A']>0]   #Boolean indexing we are checking for values of A which are greater than zero

   A                             B    C  D      E         F
0  1 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
1  2 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY
2  3 1970-01-01 00:00:00.020210302  1.0  5   true  JOHNMARY
3  4 1970-01-01 00:00:00.020210302  1.0  5  False  JOHNMARY